In [2]:
%load_ext sql
%sql mysql+mysqlconnector://root:12345@localhost/

In [2]:
%%sql
show databases

 * mysql+mysqlconnector://root:***@localhost/
6 rows affected.

[('fooddeliverypractice',),
 ('information_schema',),
 ('join_practice',),
 ('mysql',),
 ('performance_schema',),
 ('test',)]

In [3]:
%%sql
# CREATE DATABASE data_quality_project;
USE data_quality_project;

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [7]:
%%sql
CREATE TABLE source_transactions (
    transaction_id VARCHAR(20),
    customer_id VARCHAR(20),
    source_system VARCHAR(20),
    metric_name VARCHAR(20),
    metric_value DECIMAL(12,2),
    transaction_date DATE,
    record_status VARCHAR(20)
);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [8]:
%%sql
CREATE TABLE reporting_kpis (
    report_id VARCHAR(20),
    metric_name VARCHAR(20),
    reported_value DECIMAL(14,2),
    report_date DATE,
    report_owner VARCHAR(20)
);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [9]:
%%sql
CREATE TABLE data_quality_issues (
    issue_id VARCHAR(20),
    issue_type VARCHAR(20),
    affected_metric VARCHAR(20),
    severity VARCHAR(10),
    detection_date DATE,
    resolution_hours INT
);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [10]:
%%sql
show tables

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[('data_quality_issues',), ('reporting_kpis',), ('source_transactions',)]

In [13]:
%%sql
select * from reporting_kpis
limit 10;

 * mysql+mysqlconnector://root:***@localhost/
10 rows affected.

[('R19090', 'Revenue', 123796.08, '2025-12-27', 'Finance'),
 ('R27803', 'Orders', 162463.36, '2026-01-24', 'Sales'),
 ('R51915', 'Revenue', 130458.71, '2025-10-21', 'Finance'),
 ('R11986', 'Revenue', 84472.35, '2025-06-30', 'Operations'),
 ('R79567', 'Revenue', 153881.66, '2025-12-13', 'Sales'),
 ('R86191', 'Revenue', 88167.72, '2025-05-16', 'Finance'),
 ('R35321', 'Revenue', 136913.13, '2025-07-06', 'Finance'),
 ('R56801', 'Revenue', 155562.04, '2025-02-17', 'Operations'),
 ('R38106', 'Tickets', 151834.87, '2025-04-26', 'Sales'),
 ('R80584', 'Orders', 54768.62, '2025-02-15', 'Sales')]

In [14]:
%%sql
SELECT record_status, COUNT(*)
FROM source_transactions
GROUP BY record_status;

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[('valid', 27001), ('missing', 1439), ('duplicate', 1560)]

In [8]:
%%sql
show tables

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[('data_quality_issues',), ('reporting_kpis',), ('source_transactions',)]

In [11]:
%%sql
select count(*) from source_transactions;
select count(*) from reporting_kpis;

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.
1 rows affected.

[(2000,)]

In [12]:
%%sql
select * from source_transactions
limit 20;

 * mysql+mysqlconnector://root:***@localhost/
20 rows affected.

[('T000001', 'C9937', 'Billing', 'Tickets', 5.0, '2025-07-22', 'valid'),
 ('T000002', 'C3090', 'App', 'Orders', 10.0, '2025-03-10', 'valid'),
 ('T000003', 'C3377', 'App', 'Orders', 7.0, '2025-03-17', 'valid'),
 ('T000004', 'C7376', 'App', 'Revenue', 6431.19, '2025-06-01', 'valid'),
 ('T000005', 'C7433', 'App', 'Orders', None, '2025-03-17', 'missing'),
 ('T000006', 'C5629', 'Billing', 'Orders', 5.0, '2025-07-07', 'valid'),
 ('T000007', 'C8159', 'Billing', 'Tickets', 2.0, '2025-04-09', 'valid'),
 ('T000008', 'C3858', 'CRM', 'Tickets', 1.0, '2025-12-10', 'valid'),
 ('T000009', 'C2815', 'CRM', 'Orders', 6.0, '2025-02-23', 'valid'),
 ('T000010', 'C5465', 'App', 'Orders', 6.0, '2025-05-13', 'valid'),
 ('T000011', 'C3672', 'App', 'Tickets', 2.0, '2026-01-03', 'valid'),
 ('T000012', 'C2993', 'App', 'Revenue', 8807.26, '2025-11-17', 'valid'),
 ('T000013', 'C5829', 'CRM', 'Revenue', 19602.02, '2025-12-12', 'valid'),
 ('T000014', 'C2974', 'CRM', 'Revenue', 8511.1, '2026-01-04', 'valid'),
 ('T000015', 'C4932', 'Billing', 'Revenue', 12527.34, '2026-01-05', 'valid'),
 ('T000016', 'C5296', 'Billing', 'Tickets', 4.0, '2025-10-19', 'valid'),
 ('T000017', 'C6158', 'Billing', 'Orders', 7.0, '2025-06-22', 'valid'),
 ('T000018', 'C1865', 'Billing', 'Orders', 7.0, '2025-10-23', 'valid'),
 ('T000019', 'C1950', 'Billing', 'Revenue', 18470.39, '2025-09-07', 'valid'),
 ('T000020', 'C9658', 'App', 'Tickets', 5.0, '2025-07-28', 'valid')]

In [37]:
%%sql
select record_status, count(record_status) as count
from source_transactions
group by record_status

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[('valid', 27001), ('missing', 1439), ('duplicate', 1560)]

In [13]:
%%sql
SELECT 
    record_status,
    count(*) as record_count,
    count(*) * 100 / SUM(COUNT(*)) OVER () AS percentage
FROM source_transactions
GROUP BY record_status;

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[('valid', 27001, Decimal('90.0033')),
 ('missing', 1439, Decimal('4.7967')),
 ('duplicate', 1560, Decimal('5.2000'))]

In [24]:
%%sql
select metric_name,
count(*) as metric_count,
rank() over (order by count(*) desc) as rank_1
from source_transactions
group by metric_name

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[('Orders', 10125, 1), ('Tickets', 9968, 2), ('Revenue', 9907, 3)]

In [28]:
%%sql
select metric_name,
count(*) as duplicate_count
from source_transactions
where record_status = 'duplicate'
group by metric_name

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[('Orders', 544), ('Tickets', 508), ('Revenue', 508)]

In [29]:
%%sql
select metric_name,
count(*) as duplicate_count
from source_transactions
where record_status = 'valid'
group by metric_name

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[('Tickets', 8972), ('Orders', 9090), ('Revenue', 8939)]

In [30]:
%%sql
select * from reporting_kpis
limit 20;

 * mysql+mysqlconnector://root:***@localhost/
20 rows affected.

[('R19090', 'Revenue', 123796.08, '2025-12-27', 'Finance'),
 ('R27803', 'Orders', 162463.36, '2026-01-24', 'Sales'),
 ('R51915', 'Revenue', 130458.71, '2025-10-21', 'Finance'),
 ('R11986', 'Revenue', 84472.35, '2025-06-30', 'Operations'),
 ('R79567', 'Revenue', 153881.66, '2025-12-13', 'Sales'),
 ('R86191', 'Revenue', 88167.72, '2025-05-16', 'Finance'),
 ('R35321', 'Revenue', 136913.13, '2025-07-06', 'Finance'),
 ('R56801', 'Revenue', 155562.04, '2025-02-17', 'Operations'),
 ('R38106', 'Tickets', 151834.87, '2025-04-26', 'Sales'),
 ('R80584', 'Orders', 54768.62, '2025-02-15', 'Sales'),
 ('R64882', 'Tickets', 107287.67, '2025-11-04', 'Finance'),
 ('R39425', 'Revenue', 174320.74, '2025-06-03', 'Operations'),
 ('R89162', 'Revenue', 147654.84, '2025-03-14', 'Finance'),
 ('R96237', 'Orders', 168576.55, '2025-08-25', 'Operations'),
 ('R36873', 'Tickets', 187337.9, '2025-12-12', 'Finance'),
 ('R37074', 'Orders', 173245.41, '2025-12-31', 'Finance'),
 ('R71112', 'Orders', 63675.51, '2025-03-01', 'Operations'),
 ('R30632', 'Revenue', 172092.91, '2025-06-11', 'Sales'),
 ('R92941', 'Revenue', 105458.13, '2025-11-27', 'Operations'),
 ('R31114', 'Revenue', 105699.51, '2025-10-15', 'Sales')]

In [33]:
%%sql
select metric_name,
round(sum(reported_value),2) as aggregate_value
from reporting_kpis
group by metric_name;

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[('Revenue', 78816161.29), ('Orders', 84420155.45), ('Tickets', 86700853.68)]

In [35]:
%%sql
select metric_name,
round(sum(metric_value),2) as aggregate_value
from source_transactions
group by metric_name;

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[('Tickets', 28504.0), ('Orders', 52894.0), ('Revenue', 99064989.36)]